html/docker/repository.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>仓库</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="container.html"> UP </a>
 |
 <a accesskey="H" href="docker.html"> HOME </a>
</div><div id="content">
<h1 class="title">仓库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Docker Hub</a>
<ul>
<li><a href="#sec-1-1">登录</a></li>
<li><a href="#sec-1-2">基本操作</a></li>
<li><a href="#sec-1-3">自动创建</a></li>
</ul>
</li>
<li><a href="#sec-2">私有仓库</a>
<ul>
<li><a href="#sec-2-1">安装运行 docker-registry</a>
<ul>
<li><a href="#sec-2-1-1">容器运行</a></li>
<li><a href="#sec-2-1-2">本地安装</a></li>
</ul>
</li>
<li><a href="#sec-2-2">在私有仓库上传、下载、搜索镜像</a></li>
</ul>
</li>
<li><a href="#sec-3">配置文件</a>
<ul>
<li><a href="#sec-3-1">模板</a>
<ul>
<li><a href="#sec-3-1-1">示例配置</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Docker Hub</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>仓库（Repository）：集中存放镜像的地方
</li>
<li>注册服务器（registrery）： 管理仓库的具体服务器 
</li>
</ul>

<p>
每个服务器上可以有多个仓库，而每个仓库下面有多个镜像。仓库可以被认为是一个具体的项目或目录。例如对于仓库地址 dl.dockerpool.com/ubuntu 来说，dl.dockerpool.com 是注册服务器，ubuntu 是仓库名
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">登录</h3>
<div class="outline-text-3" id="text-1-1">
<p>
通过执行 docker login 命令来输入用户名、密码和邮箱来完成注册和登录。 注册成功后，本地用户目录的 .dockercfg 中将保存用户的认证信息
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">基本操作</h3>
<div class="outline-text-3" id="text-1-2">
<p>
用户无需登录即可通过 docker search 命令来查找官方仓库中的镜像
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker search centos

NAME                        DESCRIPTION                                     STARS     OFFICIAL   AUTOMATED
centos                      The official build of CentOS.                   2939      [OK]
jdeathe/centos-ssh          CentOS-6 6.8 x86_64 / CentOS-7 7.3.1611 x8...   51                   [OK]
nimmis/java-centos          This is docker images of CentOS 7 with dif...   20                   [OK]
torusware/speedus-centos    Always updated official CentOS docker imag...   8                    [OK]
nathonfowlie/centos-jre     Latest CentOS image with the JRE pre-insta...   5                    [OK]
consol/sakuli-centos-xfce   Sakuli JavaScript based end-2-end testing ...   3                    [OK]
......
</pre>
</div>
<p>
用 docker pull 命令来将它下载到本地
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker pull centos

Pulling repository centos
......
</pre>
</div>
<p>
用户也可以在登录后通过 docker push 命令来将镜像推送到 Docker Hub
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">自动创建</h3>
<div class="outline-text-3" id="text-1-3">
<p>
自动创建（Automated Builds）功能对于需要经常升级镜像内程序来说，十分方便。 有时候，用户创建了镜像，安装了某个软件，如果软件发布新版本则需要手动更新镜像
</p>

<p>
而自动创建允许用户通过 Docker Hub 指定跟踪一个目标网站（目前支持 GitHub 或 BitBucket）上的项目，一旦项目发生新的提交，则自动执行创建
</p>

<p>
要配置自动创建，包括如下的步骤：
</p>
<ol class="org-ol">
<li>创建并登录 Docker Hub，以及目标网站
</li>
<li>在目标网站中连接帐户到 Docker Hub
</li>
<li>在 Docker Hub 中 配置一个自动创建
</li>
<li>选取一个目标网站中的项目（需要含 Dockerfile）和分支
</li>
<li>指定 Dockerfile 的位置，并提交创建。
</li>
</ol>

<p>
之后，可以 在Docker Hub 的自动创建页面中跟踪每次创建的状态
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">私有仓库</h2>
<div class="outline-text-2" id="text-2">
<p>
有时候使用 Docker Hub 这样的公共仓库可能不方便，用户可以创建一个本地仓库供私人使用
</p>

<p>
docker-registry 是官方提供的工具，可以用于构建私有的镜像仓库
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">安装运行 docker-registry</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">容器运行</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
在安装了 Docker 后，使用官方的 registry 镜像来启动本地的私有仓库
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker run -d -p 5000:5000 registry
</pre>
</div>
<p>
通过指定参数来配置私有仓库位置，例如配置镜像存储到 Amazon S3 服务
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker run <span style="color: #ffa07a;">\</span>
         -e <span style="color: #eedd82;">SETTINGS_FLAVOR</span>=s3 <span style="color: #ffa07a;">\</span>
         -e <span style="color: #eedd82;">AWS_BUCKET</span>=acme-docker <span style="color: #ffa07a;">\</span>
         -e <span style="color: #eedd82;">STORAGE_PATH</span>=/registry <span style="color: #ffa07a;">\</span>
         -e <span style="color: #eedd82;">AWS_KEY</span>=AKIAHSHB43HS3J92MXZ <span style="color: #ffa07a;">\</span>
         -e <span style="color: #eedd82;">AWS_SECRET</span>=xdDowwlK7TJajV1Y7EoOZrmuPEJlHYcNP2k4j49T <span style="color: #ffa07a;">\</span>
         -e <span style="color: #eedd82;">SEARCH_BACKEND</span>=sqlalchemy <span style="color: #ffa07a;">\</span>
         -p 5000:5000 <span style="color: #ffa07a;">\</span>
         registry
</pre>
</div>
<p>
指定本地路径（如 /home/user/registry-conf ）下的配置文件
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker run -d -p 5000:5000 <span style="color: #ffa07a;">\</span>
  -v /home/user/registry-conf:/registry-conf <span style="color: #ffa07a;">\</span>
  -e <span style="color: #eedd82;">DOCKER_REGISTRY_CONFIG</span>=/registry-conf/config.yml <span style="color: #ffa07a;">\</span>
  registry
</pre>
</div>
<p>
默认情况下，仓库会被创建在容器的 /tmp/registry 下。可以通过 -v 参数来将镜像文件存放在本地的指定路径。 例如下面的例子将上传的镜像放到 /opt/data/registry 目录
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker run -d -p 5000:5000 -v /opt/data/registry:/tmp/registry registry
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">本地安装</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
对于 Ubuntu  等发行版，可以直接通过源安装
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt-get install -y build-essential python-dev libevent-dev python-pip liblzma-dev
$ sudo pip install docker-registry
</pre>
</div>
<p>
修改配置文件，主要修改 dev 模板段的 storage_path 到本地的存储仓库的路径
</p>
<div class="org-src-container">

<pre class="src src-sh">$ cp config/config_sample.yml config/config.yml
</pre>
</div>
<p>
启动 Web 服务
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo gunicorn --access-logfile - --error-logfile - -k gevent -b 0.0.0.0:5000 -w 4 --max-requests 100 docker_registry.wsgi:application
</pre>
</div>
<p>
使用 curl 访问本地的 5000 端口，看到输出 docker-registry 的版本信息说明运行成功
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">在私有仓库上传、下载、搜索镜像</h3>
<div class="outline-text-3" id="text-2-2">
<p>
创建好私有仓库之后，就可以使用 docker tag 来标记一个镜像，然后推送它到仓库，别的机器上就可以下载下来了
</p>

<p>
如私有仓库地址为 192.168.7.26:5000，使用docker tag 将 ba58 这个镜像标记为 192.168.7.26:5000/test（格式为 docker tag IMAGE[:TAG] [REGISTRYHOST/][USERNAME/]NAME[:TAG]）
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker images

REPOSITORY                        TAG                 IMAGE ID            CREATED             VIRTUAL SIZE
ubuntu                            latest              ba5877dc9bec        6 weeks ago         192.7 MB
ubuntu                            14.04               ba5877dc9bec        6 weeks ago         192.7 MB

$ sudo docker tag ba58 192.168.7.26:5000/test

$ sudo docker images

REPOSITORY                        TAG                 IMAGE ID            CREATED             VIRTUAL SIZE
ubuntu                            14.04               ba5877dc9bec        6 weeks ago         192.7 MB
ubuntu                            latest              ba5877dc9bec        6 weeks ago         192.7 MB
192.168.7.26:5000/test            latest              ba5877dc9bec        6 weeks ago         192.7 MB
</pre>
</div>

<p>
使用 docker push 上传标记的镜像
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker push 192.168.7.26:5000/test

The push refers to a repository [192.168.7.26:5000/test] (len: 1)
Sending image list
Pushing repository 192.168.7.26:5000/test (1 tags)
Image 511136ea3c5a already pushed, skipping
Image 9bad880da3d2 already pushed, skipping
Image 25f11f5fb0cb already pushed, skipping
Image ebc34468f71d already pushed, skipping
Image 2318d26665ef already pushed, skipping
Image ba5877dc9bec already pushed, skipping
Pushing tag for rev [ba5877dc9bec] on {http://192.168.7.26:5000/v1/repositories/test/tags/latest}
</pre>
</div>

<p>
用 curl 查看仓库中的镜像，这里可以看到 {"description": "", "name": "library/test"}，表明镜像已经被成功上传了
</p>
<div class="org-src-container">

<pre class="src src-sh">$ curl http://192.168.7.26:5000/v1/search

{<span style="color: #ffa07a;">"num_results"</span>: 7, <span style="color: #ffa07a;">"query"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"results"</span>: [{<span style="color: #ffa07a;">"description"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"name"</span>: <span style="color: #ffa07a;">"library/miaxis_j2ee"</span>}, {<span style="color: #ffa07a;">"description"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"name"</span>: <span style="color: #ffa07a;">"library/tomcat"</span>}, {<span style="color: #ffa07a;">"description"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"name"</span>: <span style="color: #ffa07a;">"library/ubuntu"</span>}, {<span style="color: #ffa07a;">"description"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"name"</span>: <span style="color: #ffa07a;">"library/ubuntu_office"</span>}, {<span style="color: #ffa07a;">"description"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"name"</span>: <span style="color: #ffa07a;">"library/desktop_ubu"</span>}, {<span style="color: #ffa07a;">"description"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"name"</span>: <span style="color: #ffa07a;">"dockerfile/ubuntu"</span>}, {<span style="color: #ffa07a;">"description"</span>: <span style="color: #ffa07a;">""</span>, <span style="color: #ffa07a;">"name"</span>: <span style="color: #ffa07a;">"library/test"</span>}]}
</pre>
</div>

<p>
到另外一台机器去下载这个镜像
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker pull 192.168.7.26:5000/test

Pulling repository 192.168.7.26:5000/test
ba5877dc9bec: Download complete
511136ea3c5a: Download complete
9bad880da3d2: Download complete
25f11f5fb0cb: Download complete
ebc34468f71d: Download complete
2318d26665ef: Download complete

$ sudo docker images

REPOSITORY                         TAG                 IMAGE ID            CREATED             VIRTUAL SIZE
192.168.7.26:5000/test             latest              ba5877dc9bec        6 weeks ago         192.7 MB
</pre>
</div>

<p>
使用<a href="https://raw.githubusercontent.com/yeasy/docker_practice/master/_local/push_images.sh">这个脚本</a> 批量上传本地的镜像到注册服务器中，默认是本地注册服务器 127.0.0.1:5000
</p>
<div class="org-src-container">

<pre class="src src-sh">$ wget https://github.com/yeasy/docker_practice/raw/master/_local/push_images.sh

$ sudo chmod a+x push_images.sh

$ ./push_images.sh ubuntu:latest centos:centos7

The registry server is 127.0.0.1
Uploading ubuntu:latest...
The push refers to a repository [127.0.0.1:5000/ubuntu] (len: 1)
Sending image list
Pushing repository 127.0.0.1:5000/ubuntu (1 tags)
Image 511136ea3c5a already pushed, skipping
Image bfb8b5a2ad34 already pushed, skipping
Image c1f3bdbd8355 already pushed, skipping
Image 897578f527ae already pushed, skipping
Image 9387bcc9826e already pushed, skipping
Image 809ed259f845 already pushed, skipping
Image 96864a7d2df3 already pushed, skipping
Pushing tag for rev [96864a7d2df3] on {http://127.0.0.1:5000/v1/repositories/ubuntu/tags/latest}
Untagged: 127.0.0.1:5000/ubuntu:latest
Done
Uploading centos:centos7...
The push refers to a repository [127.0.0.1:5000/centos] (len: 1)
Sending image list
Pushing repository 127.0.0.1:5000/centos (1 tags)
Image 511136ea3c5a already pushed, skipping
34e94e67e63a: Image successfully pushed
70214e5d0a90: Image successfully pushed
Pushing tag for rev [70214e5d0a90] on {http://127.0.0.1:5000/v1/repositories/centos/tags/centos7}
Untagged: 127.0.0.1:5000/centos:centos7
Done
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">配置文件</h2>
<div class="outline-text-2" id="text-3">
<p>
Docker 的 Registry 利用配置文件提供了一些仓库的模板（flavor），用户可以直接使用它们来进行开发或生产部署
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">模板</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在 config_sample.yml 文件中，可以看到一些现成的模板段：
</p>
<ul class="org-ul">
<li>common：基础配置
</li>
<li>local：存储数据到本地文件系统
</li>
<li>s3：存储数据到 AWS S3 中
</li>
<li>dev：使用 local 模板的基本配置
</li>
<li>test：单元测试使用
</li>
<li>prod：生产环境配置（基本上跟s3配置类似）
</li>
<li>gcs：存储数据到 Google 的云存储
</li>
<li>swift：存储数据到 OpenStack Swift 服务
</li>
<li>glance：存储数据到 OpenStack Glance 服务，本地文件系统为后备
</li>
<li>glance-swift：存储数据到 OpenStack Glance 服务，Swift 为后备
</li>
<li>elliptics：存储数据到 Elliptics key/value 存储
</li>
</ul>

<p>
用户也可以添加自定义的模版段，默认情况下使用的模板是 dev，要使用某个模板作为默认值，可以添加 SETTINGS_FLAVOR 到环境变量中
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">export</span> <span style="color: #eedd82;">SETTINGS_FLAVOR</span>=dev
</pre>
</div>

<p>
配置文件中支持从环境变量中加载值，语法格式为 _env:VARIABLENAME[:DEFAULT]
</p>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">示例配置</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #eedd82;">common</span>:
    <span style="color: #eedd82;">loglevel</span>: info
    <span style="color: #eedd82;">search_backend</span>: <span style="color: #ffa07a;">"_env:SEARCH_BACKEND:"</span>
    <span style="color: #eedd82;">sqlalchemy_index_database</span>:  <span style="color: #ffa07a;">"_env:SQLALCHEMY_INDEX_DATABASE:sqlite:////tmp/docker-registry.db"</span>

<span style="color: #eedd82;">prod</span>:
    <span style="color: #eedd82;">loglevel</span>: warn
    <span style="color: #eedd82;">storage</span>: s3
    <span style="color: #eedd82;">s3_access_key</span>: _env:AWS_S3_ACCESS_KEY
    <span style="color: #eedd82;">s3_secret_key</span>: _env:AWS_S3_SECRET_KEY
    <span style="color: #eedd82;">s3_bucket</span>: _env:AWS_S3_BUCKET
    <span style="color: #eedd82;">boto_bucket</span>: _env:AWS_S3_BUCKET
    <span style="color: #eedd82;">storage_path</span>: /srv/docker
    <span style="color: #eedd82;">smtp_host</span>: localhost
    <span style="color: #eedd82;">from_addr</span>: docker@myself.com
    <span style="color: #eedd82;">to_addr</span>: my@myself.com

<span style="color: #eedd82;">dev</span>:
    <span style="color: #eedd82;">loglevel</span>: debug
    <span style="color: #eedd82;">storage</span>: local
    <span style="color: #eedd82;">storage_path</span>: /home/myself/docker

<span style="color: #eedd82;">test</span>:
    <span style="color: #eedd82;">storage</span>: local
    <span style="color: #eedd82;">storage_path</span>: /tmp/tmpdockertmp
</pre>
</div>

<p>
<a href="storage.html">Next：数据卷</a>
</p>

<p>
<a href="container.html">Previous：容器</a>
</p>

<p>
<a href="docker.html">Home：目录</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
